
## Plan Result




<pre><code>Plan: 0 to add, 5 to change, 0 to destroy.</code></pre>

* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.bastion_es_rule[0]
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_resource_group.elastic-resourcegroup


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_application_security_group" "data_asg"  {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "cmda-data-asg"
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_network_security_group" "cluster_nsg"  {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/cmda-cluster-nsg" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "cmda-cluster-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "Allows SSH traffic"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "SSH"
              - priority                                   = 100
              - protocol                                   = "TCP"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows ElasticSeach communication only between nodes"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "9200",
                  - "9300",
                ]
              - direction                                  = "Inbound"
              - name                                       = "ElasticClusterTransport"
              - priority                                   = 120
              - protocol                                   = "TCP"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allows ElasticSeach queries from the LoadBalancer.  Needed for LoadBalancer healthchecks."
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "9200",
                  - "9300",
                ]
              - direction                                  = "Inbound"
              - name                                       = "LB_To_ES"
              - priority                                   = 160
              - protocol                                   = "TCP"
              - source_address_prefix                      = "AzureLoadBalancer"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Deny"
              - description                                = "Deny all traffic that is not Elastic or SSH from anywhere"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "DenyAllOtherTraffic"
              - priority                                   = 300
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow Bastion access for debugging elastic queries on development platforms"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - destination_port_range                     = "9200"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Bastion_To_ES"
              - priority                                   = 200
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.48.0.36",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow Bastion SSH access overridding templates broad SSH access"
              - destination_address_prefix                 = "10.96.149.0/24"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Bastion_To_VMs"
              - priority                                   = 230
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.48.0.36",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow AKS to access the ElasticSearch cluster"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - destination_port_range                     = "9200"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AKS_To_ES"
              - priority                                   = 215
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.10.16.0/22",
                  - "10.10.20.0/22",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow Jenkins to access the ElasticSearch cluster for testing"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - destination_port_range                     = "9200"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Jenkins_To_ES"
              - priority                                   = 220
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "10.10.70.0/23"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = "Allow Apps to access the ElasticSearch cluster"
              - destination_address_prefix                 = ""
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = [
                  - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
                ]
              - destination_port_range                     = "9200"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "App_To_ES"
              - priority                                   = 210
              - protocol                                   = "Tcp"
              - source_address_prefix                      = ""
              - source_address_prefixes                    = [
                  - "10.96.140.0/22",
                ]
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "10.146.0.0/21"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "splunk_out"
              - priority                                   = 2230
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      ~ tags                = {
          - "provider" = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/cmda-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (14 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/cmda-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (14 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.bastion_es_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "bastion_es_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/cmda-cluster-nsg/securityRules/Bastion_To_ES"
        name                                       = "Bastion_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/cmda-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/cmda-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (15 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/camunda-elastic-search-aat"
        name     = "camunda-elastic-search-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/camunda-shared-infrastructure.git"
          - "application"         = "core"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#platops-help"
          - "environment"         = "staging"
          - "lastUpdated"         = "2022-07-12T09:24:40Z"
          - "managedBy"           = "Software Engineering"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"","Vars":{}} -->